{
  "bureau": "TransUnion",
  "errorResponse": "false",
  "serviceProduct": "TUCVantageScore3",
  "serviceProductFullfillmentKey": "73499d68-37f9-48df-bdc9-113daf28bdfa",
  "serviceProductObject": {
    "CreditScoreType": {
      "CreditScoreFactor": [
        {
          "bureauCode": 98,
          "Factor": {
            "abbreviation": "",
            "description": "",
            "rank": 100000,
            "symbol": 98
          },
          "FactorText": [
            "explain: Bankruptcy is a proven indicator of risk with future payments and causes a significant drop to your credit score over an extended period of time.",
            "factor: There is a bankruptcy on your credit report",
            "cando: Make all future payments on time. The impact on your credit score from the bankruptcy will diminish over time."
          ],
          "FactorType": "Negative"
        },
        {
          "bureauCode": 14,
          "Factor": {
            "abbreviation": "",
            "description": "",
            "rank": 100000,
            "symbol": 14
          },
          "FactorText": [
            "explain: Your credit file does not contain enough information about your use of credit. A credit file with older accounts and/or more accounts reflects more experience with handling credit and can have a positive impact on your credit score.",
            "factor: Lack of sufficient credit history",
            "cando: Maintaining open and active credit accounts in good standing can help improve your credit score."
          ],
          "FactorType": "Negative"
        },
        {
          "bureauCode": 12,
          "Factor": {
            "abbreviation": "",
            "description": "",
            "rank": 100000,
            "symbol": 12
          },
          "FactorText": [
            "explain: Your oldest account is still too recent. A credit file containing older accounts will have a positive impact on your credit score because it demonstrates that you are experienced managing credit.",
            "factor: The date that you opened your oldest account is too recent",
            "cando: Don&#x27;t open more accounts than you actually need. Research shows that new accounts indicate greater risk. Your score will benefit as your accounts get older."
          ],
          "FactorType": "Negative"
        },
        {
          "bureauCode": 34,
          "Factor": {
            "abbreviation": "",
            "description": "",
            "rank": 100000,
            "symbol": 34
          },
          "FactorText": [
            "explain: Bankcard accounts include credit cards and charge cards from a bank and are frequently revolving accounts. Revolving accounts allow you to carry a balance and your monthly payment will vary, based on the amount of your balance. The total combined amount you owe on all of your bankcards and revolving accounts is high, a sign of increased risk. People who carry balances on multiple bankcards or other revolving accounts have reduced available credit to use if needed, creating a greater chance of becoming overextended.",
            "factor: Total of all balances on bankcard or revolving accounts is too high",
            "cando: Pay down the balances on your accounts. Ideally, the balance on any revolving account should be 30% or less of the total credit limit on that account."
          ],
          "FactorType": "Negative"
        },
        {
          "bureauCode": "P08",
          "Factor": {
            "abbreviation": "",
            "description": "",
            "rank": 100000,
            "symbol": "P08"
          },
          "FactorText": [
            "explain: Paying your bills on time improves your score. Recently at least one of your accounts was paid on time.",
            "factor: One or more of your accounts were paid on time in recent months",
            "cando: Keep paying bills on time every month since it is important to maintaining a good credit score. If you remain behind with any payments, bring them current as soon as possible, and then make future payments on time."
          ],
          "FactorType": "Positive"
        },
        {
          "bureauCode": "P95",
          "Factor": {
            "abbreviation": "",
            "description": "",
            "rank": 100000,
            "symbol": "P95"
          },
          "FactorText": [
            "explain: Some collection agencies report account information to credit bureaus just like lenders do. Your credit file has no or few accounts that have been sent to a collection agency and remain unpaid, which increases your score.",
            "factor: You have few or no unpaid collection agency accounts",
            "cando: Satisfy all collection accounts and pay all other accounts on time each month. The impact that negative items such as collections accounts have on your credit score will diminish over time."
          ],
          "FactorType": "Positive"
        },
        {
          "bureauCode": "P07",
          "Factor": {
            "abbreviation": "",
            "description": "",
            "rank": 100000,
            "symbol": "P07"
          },
          "FactorText": [
            "explain: Paying your bills on time improves your score. You have paid all or nearly all of your bills on time.",
            "factor: You have either no or few delinquent or derogatory accounts",
            "cando: Keep paying bills on time every month since it is important to maintaining a good credit score. If you remain behind with any payments, bring them current as soon as possible, and then make future payments on time."
          ],
          "FactorType": "Positive"
        },
        {
          "bureauCode": "P32",
          "Factor": {
            "abbreviation": "",
            "description": "",
            "rank": 100000,
            "symbol": "P32"
          },
          "FactorText": [
            "explain: Bankcard accounts include credit cards and charge cards from a bank and are frequently revolving accounts. Revolving accounts allow you to carry a balance and your monthly payment will vary, based on the amount of your balance. Your balances on bankcard or revolving accounts are not too high compared to the credit limit amounts, which causes your score to improve.",
            "factor: Balances on bankcard or revolving accts not too high compared to limits",
            "cando: Keep low balances on your accounts; this will benefit your score."
          ],
          "FactorType": "Positive"
        }
      ],
      "CreditScoreModel": {
        "abbreviation": "",
        "description": "",
        "rank": 100000,
        "symbol": "00W40"
      },
      "inquiriesAffectedScore": true,
      "NoScoreReason": {
        "abbreviation": "",
        "description": "",
        "rank": 100000,
        "symbol": ""
      },
      "populationRank": 55,
      "riskScore": 685,
      "scoreName": "VantageScore3",
      "Source": {
        "BorrowerKey": "",
        "Bureau": {
          "abbreviation": "TransUnion",
          "description": "TransUnion",
          "rank": 1,
          "symbol": "TUC"
        },
        "InquiryDate": "2021-07-08",
        "Reference": "23852984-f35c-4a91-894"
      }
    }
  },
  "serviceProductTypeId": "VantageScore",
  "serviceProductValue": "685",
  "status": "Success"
}